arduino/ArduinoCore-zephyr/boards.txt
portentac33.menu.link_mode.dynamic=Dynamic
portentac33.menu.link_mode.static=Static
portentac33.menu.link_mode.static.build.link_mode=static
portentac33.menu.link_mode.static.upload.extension=bin-zsk.bin

portentac33.build.zephyr_target=arduino_portenta_c33
portentac33.build.zephyr_args=
portentac33.build.zephyr_hals=hal_renesas nanopb
portentac33.build.zephyr_toolchain=arm-zephyr-eabi
portentac33.build.artifact=zephyr_main
portentac33.build.variant=arduino_portenta_c33_r7fa6m5bh3cfc

portentac33.build.extra_flags=
portentac33.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
portentac33.build.board=PORTENTA_C33
portentac33.upload_port.0.vid=0x2341
portentac33.upload_port.0.pid=0x0668
portentac33.upload.target=portentac33

portentac33.upload.tool=dfu-util
portentac33.upload.tool.default=dfu-util
portentac33.upload.protocol=
portentac33.upload.transport=
portentac33.upload.interface=1
portentac33.upload.use_1200bps_touch=true
portentac33.upload.wait_for_upload_port=false
portentac33.upload.native_usb=true
portentac33.upload.dfuse=

portentac33.bootloader.tool=dfu-util
portentac33.bootloader.tool.default=dfu-util
portentac33.bootloader.file=zephyr-{build.variant}.bin
portentac33.bootloader.interface=0
portentac33.bootloader.address=0x10000
portentac33.bootloader.pid=0x0368
portentac33.bootloader.dfuse=

# the space before the extra arguments is important
portentac33.leave.dfuse={empty} -Q
portentac33.loader.args.with_sketch={empty} -w
portentac33.sketch.args.without_loader={empty} -w

##########################################################################################

unor4wifi.name=Arduino UNO R4 WiFi
unor4wifi.build.core=arduino
unor4wifi.build.crossprefix=arm-zephyr-eabi-
unor4wifi.build.compiler_path={runtime.tools.arm-zephyr-eabi-0.16.8.path}/bin/

unor4wifi.menu.debug.false=Standard
unor4wifi.menu.debug.true=Debug
unor4wifi.menu.debug.true.build.zsk_args.debug=-debug

unor4wifi.menu.link_mode.dynamic=Dynamic
unor4wifi.menu.link_mode.static=Static
unor4wifi.menu.link_mode.static.build.link_mode=static
unor4wifi.menu.link_mode.static.upload.extension=bin-zsk.bin

unor4wifi.build.zephyr_target=arduino_uno_r4@wifi
unor4wifi.build.zephyr_args=
unor4wifi.build.zephyr_hals=hal_renesas
unor4wifi.build.artifact=zephyr_main
unor4wifi.build.variant=arduino_uno_r4_r7fa4m1ab3cfm
unor4wifi.build.mcu=cortex-m4
unor4wifi.build.fpu=-mfpu=fpv4-sp-d16
unor4wifi.build.architecture=cortex-m4

unor4wifi.build.float-abi=-mfloat-abi=hard
unor4wifi.build.extra_flags=
unor4wifi.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
unor4wifi.build.board=ARDUINO_UNO_R4_WIFI
unor4wifi.vid.0=0x2341
unor4wifi.pid.0=0x1002
unor4wifi.upload_port.0.vid=0x2341
unor4wifi.upload_port.0.pid=0x1002

unor4wifi.upload.tool=pyocd
unor4wifi.upload.tool.default=pyocd
unor4wifi.upload.protocol=
unor4wifi.upload.transport=
unor4wifi.upload.interface=0
unor4wifi.upload.use_1200bps_touch=false
unor4wifi.upload.wait_for_upload_port=false
unor4wifi.upload.native_usb=true
unor4wifi.upload.maximum_size=122880
unor4wifi.upload.maximum_data_size=16384
unor4wifi.upload.address=0x22000
unor4wifi.upload.target=r7fa4m1ab

unor4wifi.bootloader.tool=pyocd
unor4wifi.bootloader.tool.default=pyocd
unor4wifi.bootloader.file=zephyr-{build.variant}.elf
unor4wifi.bootloader.target=r7fa4m1ab

##########################################################################################

opta.name=Arduino Opta
opta.build.core=arduino
opta.build.crossprefix=arm-zephyr-eabi-
opta.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

opta.menu.debug.false=Standard
opta.menu.debug.true=Debug
opta.menu.debug.true.build.zsk_args.debug=-debug

opta.menu.link_mode.dynamic=Dynamic
opta.menu.link_mode.static=Static
opta.menu.link_mode.static.build.link_mode=static
opta.menu.link_mode.static.upload.extension=bin-zsk.bin

opta.build.zephyr_target=arduino_opta//m7
opta.build.zephyr_args=
opta.build.zephyr_hals=hal_stm32 hal_infineon
opta.build.zephyr_toolchain=arm-zephyr-eabi
opta.build.artifact=zephyr_main
opta.build.variant=arduino_opta_stm32h747xx_m7

opta.build.extra_flags=
opta.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
opta.build.board=OPTA
opta.upload_port.0.vid=0x2341
opta.upload_port.0.pid=0x0664

opta.upload.tool=dfu-util
opta.upload.tool.default=dfu-util
opta.upload.protocol=
opta.upload.transport=
opta.upload.interface=0
opta.upload.use_1200bps_touch=true
opta.upload.wait_for_upload_port=true
opta.upload.native_usb=true

opta.bootloader.tool=dfu-util
opta.bootloader.tool.default=dfu-util
opta.bootloader.pid=0x0364
opta.bootloader.interface=0
opta.bootloader.file=zephyr-{build.variant}.bin
opta.bootloader.address=0x08040000

opta.debug.tool=gdb
opta.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
opta.debug.server.openocd.scripts.1={programmer.transport_script}
opta.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
opta.debug.cortex-debug.custom.request=attach
opta.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd

##########################################################################################

nano_matter.name=Arduino Nano Matter
nano_matter.build.core=arduino
nano_matter.build.crossprefix=arm-zephyr-eabi-
nano_matter.build.compiler_path={runtime.tools.arm-zephyr-eabi-1.0.1.path}/bin/

nano_matter.menu.link_mode.dynamic=Dynamic
nano_matter.menu.link_mode.static=Static
nano_matter.menu.link_mode.static.build.link_mode=static
nano_matter.menu.link_mode.static.upload.extension=bin-zsk.bin

nano_matter.build.zephyr_target=arduino_nano_matter
nano_matter.build.zephyr_args=
nano_matter.build.zephyr_hals=hal_silabs
nano_matter.build.zephyr_toolchain=arm-zephyr-eabi
nano_matter.build.artifact=zephyr_main
nano_matter.build.variant=arduino_nano_matter_mgm240sd22vna

nano_matter.openocd_cfg=flash_sketch.cfg
nano_matter.build.extra_flags=
nano_matter.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nano_matter.build.board=ARDUINO_NANO_MATTER
nano_matter.upload_port.0.vid=0x2341
nano_matter.upload_port.0.pid=0x0072

